<?php
//예제 5-1 배열을 이용하여 성적의 합계와 평균 구하기
//배열 원소는 0부터 시작한다.
  $score[0] = 90; // 영어 성적
  $score[1] = 80; // 컴퓨터 개론 성적
  $score[2] = 85; // 기초 프로그래밍 성적
  $score[3] = 95; // 기초 수학 성적
  $score[4] = 93; // 알고리즘 성적

  $sum = 0;
  for($a = 0; $a <= 4; $a++){
    $sum += $score[$a];
  }

  $avg = $sum / 5;

  echo "과목 점수 : $score[0], $score[1], $score[2], $score[3], $score[4]<br>";
  echo "합계 : $sum, 평균 : $avg<br><br>";
  //과목 점수 : 90, 80, 85, 95, 93<br>합계 : 443, 평균 : 88.6<br><br>
?>

<?php
//예제 5-2 array() 함수를 이용하여 성적의 합계와 평균 구하기
  $scores = array(87, 76, 98, 87, 87, 93, 79, 85, 88, 63,
  74, 84, 93, 89, 63, 99, 81, 70, 80, 95);

  $sum = 0;
  for($a=0;$a<20;$a++){
    $sum+=$scores[$a];
  }

  $avg = $sum/20;

  echo "합계 : $sum, 평균 : $avg<br><br>";
  //합계 : 1671, 평균 : 83.55<br><br>
?>

<?php
//예제 5-3 배열을 이용하여 구구단 표 만들기
  $a=array(0); // 예제에는 안적혀있는데 scalar 오류 어쩌고 떠서 이거 적어주니까 해결!
  for($i = 0; $i < 8; $i++){
    $a[$i] = $i + 2;
    echo $a[$i]." ";
  }

  echo "<br>";

  for($j = 0; $j < 9; $j++){
    $b[$j] = $j + 1;
    echo $b[$j]." ";
  }

  echo "<br>---------------------<br>";

  for($i = 0; $i < 9; $i++){
    $c = $a[0] * $b[$i]; // 2단
    echo "$a[0] * $b[$i] = $c<br>";
  }

  echo "---------------------<br>";

  for($i = 0; $i < 8; $i++){
    $c = $a[4] * $b[$i]; // 6단
    echo "$a[4] * $b[$i] = $c<br>";
  }

  echo "---------------------<br>";
  //2 3 4 5 6 7 8 9 <br>1 2 3 4 5 6 7 8 9 <br>---------------------<br>
  //2 * 1 = 2<br>2 * 2 = 4<br>2 * 3 = 6<br>2 * 4 = 8<br>2 * 5 = 10<br>
  //2 * 6 = 12<br>2 * 7 = 14<br>2 * 8 = 16<br>2 * 9 = 18
  //<br>---------------------<br>
  //6 * 1 = 6<br>6 * 2 = 12<br>6 * 3 = 18<br>6 * 4 = 24<br>6 * 5 = 30<br>
  //6 * 6 = 36<br>6 * 7 = 42<br>6 * 8 = 48<br>---------------------<br>
?>

<?php
//예제 5-4 오름차순으로 버블 정렬하기
  $num = array(15, 13, 9, 7, 6, 12, 19, 30, 28, 26);
  $count = 10; // 배열 원소의 개수

  echo "정렬 전 : ";
  for($i=0;$i<$count;$i++){
    echo $num[$i]." ";
  }
  echo "<br>";

  for($i = $count - 2; $i>=0; $i--){
    for($j = 0; $j <= $i; $j++){
      if($num[$j]>$num[$j+1]){
        $tmp = $num[$j];
        $num[$j] = $num[$j+1];
        $num[$j+1] = $tmp;
      }
    }
  }

  echo "버블 정렬(오름차순) 후 : ";
  for($i=0;$i<$count;$i++){
    echo $num[$i]." ";
  }

  //정렬 전 : 15 13 9 7 6 12 19 30 28 26 <br>버블 정렬(오름차순) 후 : 6 7 9 12 13 15 19 26 28 30

  echo "<br><br>";
?>

<?php
//예제 5-5 2차원 배열을 이용하여 성적의 합계와 평균 구하기
  $score=array(array(88, 98, 96, 77, 63),
    array(86, 77, 66, 86, 93),
    array(74, 83, 95, 86, 97));

  $sum = array();
  $avg = array();

    //입력된 성적과 배열 인덱스 출력
  for($i = 0; $i <3; $i++){
    $sum[$i] = 0;
    for($j=0; $j<5; $j++){
      echo "\$score[$i][$j] = ".$score[$i][$j]."<br>";
      $sum[$i]+=$score[$i][$j];
    }
    $avg[$i] = $sum[$i]/5;
    echo "<br>";
  }

  for($i=0;$i<3; $i++){
    $student_num = $i+1;
    echo $student_num."번 학생의 점수 => 합계 : $sum[$i], 평균 : $avg[$i]<br>";
  }

  //$score[0][0] = 88<br>$score[0][1] = 98<br>$score[0][2] = 96<br>
  //$score[0][3] = 77<br>$score[0][4] = 63<br><br>$score[1][0] = 86<br>
  //$score[1][1] = 77<br>$score[1][2] = 66<br>$score[1][3] = 86<br>
  //$score[1][4] = 93<br><br>$score[2][0] = 74<br>$score[2][1] = 83<br>
  //$score[2][2] = 95<br>$score[2][3] = 86<br>$score[2][4] = 97<br><br>
  //1번 학생의 점수 => 합계 : 422, 평균 : 84.4<br>
  //2번 학생의 점수 => 합계 : 408, 평균 : 81.6<br>
  //3번 학생의 점수 => 합계 : 435, 평균 : 87<br>
?>
